Catalogs/ШаблоныВыплатПоДоговорамОпеки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Catalog>
		<Properties>
			<Name>ШаблоныВыплатПоДоговорамОпеки</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Выплаты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВыплачиваетсяПриВозрастеОт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВыплачиваетсяПриВозрастеДо</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособРасчета</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СпособыРасчетаВыплатПоДоговорамОпеки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПрожиточныйМинимум</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПрожиточныеМинимумы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Размер</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИсключаяДатуОт</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВключаяДатуДо</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/СпособыРасчетаВыплатПоДоговорамОпеки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>СпособыРасчетаВыплатПоДоговорамОпеки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>КоэффициентНаМРОТ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КоэффициентНаПрожиточныйМинимум</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФиксированныйРазмер</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ШаблоныВыплатПоДоговорамОпеки/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ВыплатыОграниченияПоВозрастуПредставление",
		"Видимость",
		ПолучитьФункциональнуюОпцию("УчитыватьВозрастРебенкаПриВыплатахПоДоговорамОпеки"));
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ВыплатыПоДоговорамОпеки.ЗаполнитьВсеПоляПредставленийВыплаты(Объект);

КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ВыплатыПоДоговорамОпеки.ЗаполнитьВсеПоляПредставленийВыплаты(Объект);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыВыплаты

&НаКлиенте
Процедура ВыплатыОграниченияПоВозрастуПредставлениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекДанные = Элементы.Выплаты.ТекущиеДанные;
	ПараметрыОграничений = ВыплатыПоДоговорамОпекиКлиент.ПараметрыОграниченийПоВозрасту();
	ПараметрыОграничений.ВозрастОт = ТекДанные.ВыплачиваетсяПриВозрастеОт;
	ПараметрыОграничений.ВозрастДо = ТекДанные.ВыплачиваетсяПриВозрастеДо;
	ПараметрыОграничений.ИсключаяДатуОт = ТекДанные.ИсключаяДатуОт;
	ПараметрыОграничений.ВключаяДатуДо = ТекДанные.ВключаяДатуДо;
	ВыплатыПоДоговорамОпекиКлиент.ВводОграниченийПоВозрасту(ПараметрыОграничений, Элементы.ВыплатыОграниченияПоВозрастуПредставление);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыплатыОграниченияПоВозрастуПредставлениеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если ТипЗнч(ВыбранноеЗначение)=Тип("Структура") Тогда
		РезультатВыбора = Новый ФиксированнаяСтруктура(ВыбранноеЗначение);
		ТекДанные = Элементы.Выплаты.ТекущиеДанные;
		ТекДанные.ВыплачиваетсяПриВозрастеОт = РезультатВыбора.ВозрастОт;
		ТекДанные.ВыплачиваетсяПриВозрастеДо = РезультатВыбора.ВозрастДо;
		ТекДанные.ИсключаяДатуОт = РезультатВыбора.ИсключаяДатуОт;
		ТекДанные.ВключаяДатуДо = РезультатВыбора.ВключаяДатуДо;
		ВыбранноеЗначение = ВыплатыПоДоговорамОпекиКлиентСервер.ОграниченияПоВозрастуПредставление(
			ТекДанные.ВыплачиваетсяПриВозрастеОт, ТекДанные.ВыплачиваетсяПриВозрастеДо,
			ТекДанные.ИсключаяДатуОт, ТекДанные.ВключаяДатуДо);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВыплатыРасчетРазмераВыплатыПредставлениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекДанные = Элементы.Выплаты.ТекущиеДанные;
	ПараметрыРасчетаРазмераВыплаты = Новый Структура;
	ПараметрыРасчетаРазмераВыплаты.Вставить("СпособРасчета", ТекДанные.СпособРасчета);
	ПараметрыРасчетаРазмераВыплаты.Вставить("ПрожиточныйМинимум", ТекДанные.ПрожиточныйМинимум);
	ПараметрыРасчетаРазмераВыплаты.Вставить("Размер", ТекДанные.Размер);
	ПараметрыРасчетаРазмераВыплаты.Вставить("Коэффициент", ТекДанные.Коэффициент);
	ВыплатыПоДоговорамОпекиКлиент.ВводДанныхДляРасчетаРазмераВыплаты(ПараметрыРасчетаРазмераВыплаты, Элементы.ВыплатыРасчетРазмераВыплатыПредставление);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыплатыРасчетРазмераВыплатыПредставлениеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СпособРасчетаФиксированныйРазмер             = ПредопределенноеЗначение("Перечисление.СпособыРасчетаВыплатПоДоговорамОпеки.ФиксированныйРазмер");
	СпособРасчетаКоэффициентНаПрожиточныйМинимум = ПредопределенноеЗначение("Перечисление.СпособыРасчетаВыплатПоДоговорамОпеки.КоэффициентНаПрожиточныйМинимум");
	СпособРасчетаКоэффициентНаМРОТ               = ПредопределенноеЗначение("Перечисление.СпособыРасчетаВыплатПоДоговорамОпеки.КоэффициентНаМРОТ");
	
	Если ТипЗнч(ВыбранноеЗначение)=Тип("Структура") Тогда
		РезультатВыбора = Новый ФиксированнаяСтруктура(ВыбранноеЗначение);
		ТекДанные = Элементы.Выплаты.ТекущиеДанные;
		ТекДанные.СпособРасчета = РезультатВыбора.СпособРасчета;
		Если ТекДанные.СпособРасчета=СпособРасчетаФиксированныйРазмер Тогда 
			ТекДанные.ПрожиточныйМинимум = Неопределено;
			ТекДанные.Размер = РезультатВыбора.Размер;
			ТекДанные.Коэффициент = 1;
		ИначеЕсли ТекДанные.СпособРасчета=СпособРасчетаКоэффициентНаПрожиточныйМинимум Тогда
			ТекДанные.ПрожиточныйМинимум = РезультатВыбора.ПрожиточныйМинимум;
			ТекДанные.Размер = 0;
			ТекДанные.Коэффициент = РезультатВыбора.Коэффициент;
		ИначеЕсли ТекДанные.СпособРасчета=СпособРасчетаКоэффициентНаМРОТ Тогда
			ТекДанные.ПрожиточныйМинимум = Неопределено;
			ТекДанные.Размер = 0;
			ТекДанные.Коэффициент = РезультатВыбора.Коэффициент;
		Иначе 
			ТекДанные.ПрожиточныйМинимум = Неопределено;
			ТекДанные.Размер = 0;
			ТекДанные.Коэффициент = 1;
		КонецЕсли;
		ВыбранноеЗначение = ВыплатыПоДоговорамОпекиКлиентСервер.РасчетРазмераВыплатыПредставление(
			ТекДанные.СпособРасчета, ТекДанные.ПрожиточныйМинимум, ТекДанные.Размер, ТекДанные.Коэффициент);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыплатыПриИзменении(Элемент)
	ТекДанные = Элементы.Выплаты.ТекущиеДанные;
	Если ТекДанные<>Неопределено Тогда 
		ТекДанные.ОграниченияПоВозрастуПредставление = ВыплатыПоДоговорамОпекиКлиентСервер.ОграниченияПоВозрастуПредставление(
			ТекДанные.ВыплачиваетсяПриВозрастеОт, ТекДанные.ВыплачиваетсяПриВозрастеДо, 
			ТекДанные.ИсключаяДатуОт, ТекДанные.ВключаяДатуДо);
		ТекДанные.РасчетРазмераВыплатыПредставление = ВыплатыПоДоговорамОпекиКлиентСервер.РасчетРазмераВыплатыПредставление(
			ТекДанные.СпособРасчета, ТекДанные.ПрожиточныйМинимум, ТекДанные.Размер, ТекДанные.Коэффициент);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВыплатыПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	Если ОтменаРедактирования Тогда
		Возврат;
	КонецЕсли;
	ТекДанные = Элементы.Выплаты.ТекущиеДанные;
	ТекИдентификатор = ТекДанные.ПолучитьИдентификатор();
	Для Каждого СтрокаВыплаты Из Объект.Выплаты Цикл 
		Если СтрокаВыплаты.ПолучитьИдентификатор()<>ТекИдентификатор Тогда 
			Если (СтрокаВыплаты.ВыплачиваетсяПриВозрастеДо=ТекДанные.ВыплачиваетсяПриВозрастеОт И СтрокаВыплаты.ВключаяДатуДо И Не ТекДанные.ИсключаяДатуОт) Тогда 
				Если (СтрокаВыплаты.ВыплачиваетсяПриВозрастеДо=ТекДанные.ВыплачиваетсяПриВозрастеОт И СтрокаВыплаты.ВключаяДатуДо И Не ТекДанные.ИсключаяДатуОт) Тогда 
					ТекстОшибки = СтрШаблон(НСтр("ru = 'День начала выплаты номер %1 накладывается на день окончания выплаты номер %2.'"), 
						ТекДанные.НомерСтроки, СтрокаВыплаты.НомерСтроки);
					ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки, , 
						СтрШаблон("Объект.Выплаты[%1].ОграниченияПоВозрастуПредставление", ТекДанные.НомерСтроки-1));
				КонецЕсли;
				Если (СтрокаВыплаты.ВыплачиваетсяПриВозрастеОт=ТекДанные.ВыплачиваетсяПриВозрастеДо И Не СтрокаВыплаты.ИсключаяДатуОт И ТекДанные.ВключаяДатуДо) Тогда 
					ТекстОшибки = СтрШаблон(НСтр("ru = 'День окончания выплаты номер %1 накладывается на день начала выплаты номер %2.'"), 
						ТекДанные.НомерСтроки, СтрокаВыплаты.НомерСтроки);
					ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки, , 
						СтрШаблон("Объект.Выплаты[%1].ОграниченияПоВозрастуПредставление", ТекДанные.НомерСтроки-1));
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти
